{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Booking, Partner, Payment, etc.) and state maps for a scrap collection service backend, with access control and blob storage mixins included.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs to their titles, affected files, component dependencies, and test IDs, covering auth flow restoration (OTP login, profile setup, splash redirect) and other app features.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, describing key fixes and functionality for pages like Payment, Bookings, TrackPickup, and others.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes (colors, radius, sidebar, charts) used throughout the app.",
  "frontend/index.html": "HTML shell for the Bhangar Wala PWA, setting up viewport meta tags, PWA manifest link, app icon, and mounting the React app at the `#root` div.",
  "frontend/public/manifest.json": "PWA web app manifest for Bhangar Wala defining app name, theme color, display mode, icons (192px and 512px), and start URL for installable mobile experience.",
  "frontend/public/sw.js": "Service worker implementing cache-first for static assets and network-first for API/canister calls, with explicit bypass rules for Internet Identity domains and ICP `/api/v2/` endpoints to prevent mobile auth failures.",
  "frontend/src/App.tsx": "Defines the full client-side routing tree using TanStack Router, mapping paths to page components (both eagerly and lazily loaded) including public, authenticated, partner, and admin routes.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a sticky header, notification bell with unread badge, and a bottom navigation bar that hides on certain pages; redirects unauthenticated users to login.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient lifecycle, login/logout flow, delegation validity, and exposing identity state to the app.",
  "frontend/src/hooks/useNotifications.ts": "Thin wrapper around the notifications query that exposes the notification list, unread count, loading state, and a refetch function.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks and local TypeScript types for interacting with the ICP backend, covering user profiles, addresses, scrap categories/rates, bookings, payments, ratings, notifications, and support tickets.",
  "frontend/src/index.css": "Sets up global styles using Tailwind CSS, defines an eco-green OKLCH design token theme (light and dark), imports Poppins/Inter fonts, and adds custom utility classes and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AddAddress.tsx": "A form page that allows users to add a new address with label, street, city, and pincode fields, then saves it via the useAddAddress mutation and navigates to the addresses list.",
  "frontend/src/pages/Addresses.tsx": "Displays a list of the user's saved addresses with options to edit or delete each, and includes a FAB button to navigate to the AddAddress page.",
  "frontend/src/pages/AdminBookings.tsx": "Admin page that lists all bookings with status-based color coding, supports filtering by status and searching by text, and navigates to individual booking details on click.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing summary stat cards (total bookings, revenue, active partners, open tickets) and navigation cards linking to bookings, partners, support, and analytics sections.",
  "frontend/src/pages/AdminPartners.tsx": "Admin page for managing delivery partners, supporting listing, adding, editing, and toggling active status of partners via a card-based UI with an inline form.",
  "frontend/src/pages/AdminRates.tsx": "Admin page for managing scrap rates per category, allowing admins to view and update price-per-kg values with immediate effect on new bookings.",
  "frontend/src/pages/AdminShopRegistrations.tsx": "Admin page for reviewing scrap shop registrations, supporting filtering by status and approving or rejecting pending shops.",
  "frontend/src/pages/AdminSupportTickets.tsx": "Admin page for viewing and managing support tickets, allowing filtering by status and toggling tickets between open and resolved.",
  "frontend/src/pages/BookingConfirmation.tsx": "Page displayed after a booking is created, showing booking details, assigned partner info, and an option to cancel the booking.",
  "frontend/src/pages/BookingDetails.tsx": "Displays detailed information for a single booking including address, items, partner info, payment, and status badge, fetching all related data via custom query hooks.",
  "frontend/src/pages/Bookings.tsx": "Lists all user bookings with search and status filter chips, sorted by scheduled time, navigating to booking details on tap.",
  "frontend/src/pages/BookPickup.tsx": "Multi-step form page for users to book a scrap pickup by selecting an address, scrap category/weight, and a scheduled date/time slot.",
  "frontend/src/pages/EditAddress.tsx": "Form page for editing an existing saved address (label, street, city, pincode), pre-populated from the address query and saved via an update mutation.",
  "frontend/src/pages/Home.tsx": "Home dashboard showing a personalized greeting, scrap category grid, a schedule-pickup CTA card, and a list of the three most recent bookings.",
  "frontend/src/pages/Login.tsx": "Phone number login page with country code selector and terms acceptance checkbox that stores the phone in sessionStorage and navigates to OTP verification.",
  "frontend/src/pages/Notifications.tsx": "Displays a list of user notifications with unread count, mark-all-read, and clear-all actions, using icons and color-coded backgrounds based on notification type.",
  "frontend/src/pages/OtpVerification.tsx": "OTP verification page with a 6-digit input, countdown resend timer, and logic to redirect users to home or profile setup based on whether they have an existing profile.",
  "frontend/src/pages/PartnerPanel.tsx": "Partner-facing panel where delivery partners can look up their bookings by phone, accept available bookings, and advance booking statuses through the pickup workflow.",
  "frontend/src/pages/Payment.tsx": "Payment page that calculates final scrap amounts from booking items and rates, supports cash or UPI payment methods, and completes the booking on submission.",
  "frontend/src/pages/PaymentSuccess.tsx": "Post-payment success screen showing an animated checkmark, total amount paid, and a printable receipt with itemized scrap details and payment method.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying name, phone, and avatar with options to edit name, toggle notifications/dark mode, access the admin panel, and log out.",
  "frontend/src/pages/ProfileSetup.tsx": "Onboarding page for new users to set their name, phone, profile image, and optional home address before navigating to the home screen.",
  "frontend/src/pages/RateService.tsx": "Post-booking rating page where users can submit a 1–5 star rating and optional comment for a completed pickup service.",
  "frontend/src/pages/ShopRegister.tsx": "Multi-language scrap shop registration form collecting owner details, address, and scrap categories, with support for English, Hindi, Marathi, Gujarati, and Marwadi.",
  "frontend/src/pages/ShopRegisterStatus.tsx": "Multi-language page showing the approval status (pending, approved, or rejected) of a scrap shop registration looked up by phone number.",
  "frontend/src/pages/Splash.tsx": "Animated splash screen that checks for a verified auth session in localStorage and redirects to either the home or login page after a 2.2-second delay.",
  "frontend/src/pages/Support.tsx": "Support page with contact buttons (call, WhatsApp, email), an FAQ accordion, and a support ticket submission form that uses the useSubmitSupportTicket hook.",
  "frontend/src/pages/TrackPickup.tsx": "Track Pickup page that displays real-time booking status steps, partner info, cancel/simulate-next-status controls, and navigates to payment when the pickup is completed.",
  "frontend/src/utils/blobStorage.ts": "Defines an ExternalBlob utility class that wraps binary data or a URL, supporting byte retrieval, object URL generation, and upload progress callbacks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens, typography fonts (Poppins/Inter), border radii, box shadows, and animation keyframes, with dark mode and plugin support.",
  "project_state.json": "Project state snapshot (version 23) describing the Bhangar Wala PWA architecture, tech stack (React, Vite, Supabase), existing features, known issues, and design/DB schema notes."
}