{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Booking, Partner, Payment, etc.), state maps, and includes authorization and blob-storage mixins for a scrap collection service backend.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: replacing phone OTP login with Internet Identity authentication, and updating the Profile Setup screen to use the II principal instead of a phone number from localStorage.",
  "frontend-file-summaries.txt": "A JSON document containing one-to-two sentence summaries of each frontend source file, describing the purpose and notable fixes for every page and utility in the app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, etc.) used throughout the app.",
  "frontend/index.html": "HTML shell for the Bhangar Wala PWA, setting viewport/theme meta tags, linking the web manifest and Apple touch icon, and mounting the React app via `/src/main.tsx`.",
  "frontend/public/manifest.json": "PWA web app manifest for Bhangar Wala, specifying app name, theme color, standalone display mode, and two icon sizes (192×192 and 512×512).",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets and cache-second (network-first) strategy for API/canister calls and the app shell, with fallback to index.html for SPA navigation.",
  "frontend/src/App.tsx": "Main React router configuration using TanStack Router, defining all app routes including a redirect from the removed `/otp-verification` route to `/login`, and lazy-loading admin, partner, and shop registration pages.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header (logo, location, notifications bell) and a bottom navigation bar; hides nav on certain routes and redirects unauthenticated users to login.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication via a React context, exposing login/logout functions, identity state, and status flags backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Thin wrapper around useGetNotifications that exposes the notifications list, unread count, loading state, and a refetch function.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks and local TypeScript types for the app's data layer, covering user profiles, addresses, bookings, scrap categories/rates, partners, payments, ratings, notifications, and support tickets.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, defines the eco-green OKLCH design token theme (light and dark), and adds custom utility classes and keyframe animations.",
  "frontend/src/main.tsx": "App entry point that mounts the React tree with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AddAddress.tsx": "Page for adding a new pickup address with a form for label, street, city, and pincode fields, plus a map placeholder; saves via the useAddAddress mutation and navigates back to the addresses list.",
  "frontend/src/pages/Addresses.tsx": "Displays a list of the user's saved addresses with options to add, edit, or delete each one, using icons to distinguish Home/Work/Other labels.",
  "frontend/src/pages/AdminBookings.tsx": "Admin page that lists all bookings with status-based color coding, search, and filter controls, allowing navigation to individual booking details.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing high-level stats (bookings, revenue, partners, tickets) and navigation cards linking to all admin sub-sections.",
  "frontend/src/pages/AdminPartners.tsx": "Admin page for managing delivery partners, supporting add/edit via a form modal and toggling partner active status with a switch.",
  "frontend/src/pages/AdminRates.tsx": "Admin page for viewing and updating per-kg scrap rates for each category, with inline editable rows that save changes immediately via mutation.",
  "frontend/src/pages/AdminShopRegistrations.tsx": "Admin page for managing scrap shop registrations, displaying shops in filterable cards with approve/reject actions and status badges (pending, approved, rejected).",
  "frontend/src/pages/AdminSupportTickets.tsx": "Admin page for viewing and managing support tickets, allowing filtering by status and toggling tickets between open and resolved via a switch control.",
  "frontend/src/pages/BookingConfirmation.tsx": "Post-booking confirmation page that displays booking details, auto-assigns a partner, and allows the user to cancel the booking.",
  "frontend/src/pages/BookingDetails.tsx": "Detail view for a single booking showing address, scrap items with rates, scheduled time, assigned partner, payment info, and current status badge.",
  "frontend/src/pages/Bookings.tsx": "Displays a filterable, searchable list of the user's scrap pickup bookings with status badges and navigation to individual booking details.",
  "frontend/src/pages/BookPickup.tsx": "Multi-step form page for booking a scrap pickup, guiding users through address selection, scrap category/weight entry, date/time slot scheduling, and confirmation.",
  "frontend/src/pages/EditAddress.tsx": "Form page for editing an existing saved address, pre-populating fields from the fetched address and saving updates via a mutation hook.",
  "frontend/src/pages/Home.tsx": "Home dashboard showing a personalized greeting, scrap category grid, a book-pickup CTA card, and a list of recent bookings.",
  "frontend/src/pages/Login.tsx": "Login page that authenticates users via Internet Identity, then redirects to the home screen or profile setup based on whether a profile exists.",
  "frontend/src/pages/Notifications.tsx": "Notifications page that lists user notifications sorted by timestamp, with actions to mark all as read or clear all notifications.",
  "frontend/src/pages/OtpVerification.tsx": "OTP verification page that renders a 6-digit code input, countdown timer for resend, and triggers Internet Identity login on submission, then redirects to profile setup or home based on whether a user profile exists.",
  "frontend/src/pages/PartnerPanel.tsx": "Partner-facing dashboard where a delivery partner can look up their bookings by phone number, accept pending bookings, and advance booking statuses through the pickup workflow.",
  "frontend/src/pages/Payment.tsx": "Payment page that displays booking line items with editable final weights and calculated totals, supports Cash or UPI payment methods, and creates a payment record while marking the booking as completed.",
  "frontend/src/pages/PaymentSuccess.tsx": "Post-payment success screen showing an animated checkmark, receipt details (items, rates, total, payment method), and options to navigate home or download the receipt.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying name, phone, and avatar with options to edit the display name, toggle notifications/dark mode, access the admin panel, and log out via Internet Identity.",
  "frontend/src/pages/ProfileSetup.tsx": "A profile setup page where users enter their name, phone, profile photo, and optional home address, then save the data via mutation hooks before navigating to the home screen.",
  "frontend/src/pages/RateService.tsx": "A post-booking rating page that lets users select 1–5 stars and optionally leave a comment, then submits the rating via a mutation hook or skips to home.",
  "frontend/src/pages/ShopRegister.tsx": "A multi-language scrap shop registration form supporting English, Hindi, Marathi, Gujarati, and Marwadi, collecting owner/shop details and scrap categories before submitting via a mutation hook.",
  "frontend/src/pages/ShopRegisterStatus.tsx": "A multi-language page that displays the approval status (pending, approved, or rejected) of a scrap shop registration looked up by phone number, with options to re-register or go home.",
  "frontend/src/pages/Splash.tsx": "An animated splash/loading screen that waits 2.2 seconds, then redirects authenticated users to home or unauthenticated users to the login page.",
  "frontend/src/pages/Support.tsx": "A support page with contact buttons (call, WhatsApp, email), an FAQ accordion, and a support ticket submission form that calls a mutation hook on submit.",
  "frontend/src/pages/TrackPickup.tsx": "React page for tracking a scrap pickup booking, displaying a step-by-step status timeline, partner info, and controls to cancel, simulate status progression, or proceed to payment.",
  "frontend/src/utils/blobStorage.ts": "Defines an ExternalBlob utility class that wraps binary data or a URL, supporting creation from bytes or URL, upload progress callbacks, and retrieval as object URL or raw bytes.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and clearing sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Poppins/Inter), oklch-based color tokens, border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state for the Bhangar Wala PWA, including architecture notes, tech stack, known issues, and a versioned list of implemented features."
}