{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Booking, Partner, Payment, etc.) and including authorization and blob storage mixins for a scrap collection service backend.",
  "backend/migration.mo": "Migration module that upgrades old Booking records (without an embedded address) to new Booking records by adding a default empty address field.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated file paths, component dependencies, test IDs, and confidence levels for fixes to AddAddress, BookPickup, and other screens.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing the purpose and key fixes applied to each page, hook, or utility.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the Bhangar Wala PWA, setting up viewport meta tags, PWA manifest link, app icons, and mounting the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for Bhangar Wala defining app name, theme colors, display mode, icons, and start URL for installable mobile experience.",
  "frontend/public/sw.js": "Service worker implementing cache-first for static assets and network-first for API/canister calls, with explicit bypass rules for Internet Identity and ICP API endpoints.",
  "frontend/src/App.tsx": "Defines the full client-side routing tree using TanStack Router, mapping paths to page components (both eagerly and lazily loaded) for a scrap-pickup app with user, partner, and admin flows.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a sticky header (logo, location, notification bell) and a bottom navigation bar, hiding the nav on certain pages and redirecting unauthenticated users to login.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, reinitializing it when the identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and status flags to child components.",
  "frontend/src/hooks/useNotifications.ts": "Thin wrapper around the notifications query that computes and exposes the count of unread notifications alongside the full list and loading state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the ICP backend, covering user profiles, addresses, bookings, payments, support tickets, and more.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines the eco-green OKLCH design token theme (light and dark), plus custom animations and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AddAddress.tsx": "A form page that allows users to add a new delivery/pickup address with label (Home/Work/Other), street, city, and pincode fields, using the useAddAddress mutation hook to save and navigate to the addresses list.",
  "frontend/src/pages/Addresses.tsx": "Displays a list of the user's saved addresses with options to edit or delete each one, fetching data via useGetUserAddresses and supporting deletion via useDeleteAddress.",
  "frontend/src/pages/AdminBookings.tsx": "Admin page that lists all bookings with status filter chips and a search bar (by ID, phone, or name), fetching data via useGetAllBookings and displaying each booking's status with a colored badge.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing summary stats (active bookings, revenue, completed bookings, active partners) and navigation cards to management sections like bookings, partners, rates, support tickets, shop registrations, and ratings.",
  "frontend/src/pages/AdminPartners.tsx": "Admin page for managing delivery partners, supporting add/edit via an inline form and toggling active status, using useGetPartners, useAddPartner, and useUpdatePartner hooks.",
  "frontend/src/pages/AdminRates.tsx": "Admin page for viewing and editing scrap rates per category, allowing inline price updates with immediate effect on new bookings.",
  "frontend/src/pages/AdminShopRegistrations.tsx": "Admin page for managing scrap shop registrations, supporting filtering by status and approve/reject actions on individual shop cards.",
  "frontend/src/pages/AdminSupportTickets.tsx": "Admin page for listing and managing support tickets with status filtering and a toggle switch to mark tickets as open or resolved.",
  "frontend/src/pages/BookingConfirmation.tsx": "Booking detail page that displays confirmed booking info including address, schedule, items, and assigned partner, with an option to cancel the booking.",
  "frontend/src/pages/BookingDetails.tsx": "Displays detailed information for a single booking by ID, including status, items, partner info, and payment details, with loading skeletons and a back navigation to the bookings list.",
  "frontend/src/pages/Bookings.tsx": "Lists all user bookings with status filter chips and a search-by-ID input, showing each booking as a card with date and status badge, navigating to booking details on click.",
  "frontend/src/pages/BookPickup.tsx": "Multi-step pickup booking flow where users select an address, schedule, and scrap items with estimated weights to create a new booking.",
  "frontend/src/pages/EditAddress.tsx": "Form page for editing an existing saved address, pre-populating fields from the fetched address list and submitting updates via the updateAddress mutation.",
  "frontend/src/pages/Home.tsx": "Main home screen showing a welcome header with a book-pickup CTA, a grid of scrap categories, and a list of the user's three most recent bookings.",
  "frontend/src/pages/Login.tsx": "Phone number login page with country code selector, terms acceptance checkbox, and OTP initiation that stores the phone in sessionStorage before navigating to OTP verification.",
  "frontend/src/pages/Notifications.tsx": "Displays a list of user notifications with unread count, mark-all-read, and clear-all actions, using icons and color-coded backgrounds based on notification type.",
  "frontend/src/pages/OtpVerification.tsx": "Renders a 6-digit OTP input form for phone verification, saves an auth session to localStorage, checks for an existing user profile, and navigates to home or profile setup accordingly.",
  "frontend/src/pages/PartnerPanel.tsx": "Partner-facing dashboard where a delivery partner can look up their profile by phone, view assigned bookings, accept new bookings, and advance booking statuses through a defined workflow.",
  "frontend/src/pages/Payment.tsx": "Payment page that calculates totals from booking items and scrap rates, supports cash or UPI payment methods, creates a payment record, and updates the booking status to completed on success.",
  "frontend/src/pages/PaymentSuccess.tsx": "Confirmation screen shown after a successful payment, displaying a receipt with itemized scrap weights and subtotals, total amount paid, and payment method details.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying name, phone, and avatar with edit functionality, notification/dark mode toggles, admin panel quick access, and logout that clears local auth session and query cache.",
  "frontend/src/pages/ProfileSetup.tsx": "Onboarding page for new users to set their name, phone, optional profile photo, and address, then calls the backend `createUserProfile` actor method and navigates to home on success.",
  "frontend/src/pages/RateService.tsx": "Page for rating a completed booking with a 1–5 star selector and optional comment, submitting via `useSubmitRating` and redirecting home after a success confirmation.",
  "frontend/src/pages/ShopRegister.tsx": "Multi-language scrap shop registration form (English, Hindi, Marathi, Gujarati, Marwadi) collecting owner/shop details, address, and scrap categories, then submitting via `useRegisterScrapShop`.",
  "frontend/src/pages/ShopRegisterStatus.tsx": "Multi-language page that fetches and displays the current registration status (pending/approved/rejected) of the user's scrap shop, with options to go home or re-register.",
  "frontend/src/pages/Splash.tsx": "Animated splash/loading screen that checks localStorage for a verified auth session after 2.2 seconds and redirects to either the home page or the login page.",
  "frontend/src/pages/Support.tsx": "Support page with contact buttons (call, WhatsApp, email), an FAQ accordion section, and a support ticket submission form using the useSubmitSupportTicket hook.",
  "frontend/src/pages/TrackPickup.tsx": "Track Pickup page that displays real-time booking status steps, partner info, and allows cancellation or simulated status progression, navigating to payment when completed.",
  "frontend/src/utils/blobStorage.ts": "Defines an ExternalBlob utility class that wraps binary data or a URL, supporting byte retrieval, direct URL generation, and upload progress callbacks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routes, with sessionStorage persistence helpers and a function to remove params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts (Poppins/Inter), oklch-based color tokens, border radii, box shadows, and keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 27) describing the Bhangar Wala PWA architecture, tech stack (React, Vite, Supabase), existing features, known issues, and design/localization requirements."
}