{
  "backend/main.mo": "Main Motoko actor for the Bhangar Wala backend, defining all data types (UserProfile, Booking, Payment, etc.), in-memory state maps, and business logic endpoints for a scrap collection service. Includes authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping the full-stack Bhangar Wala deployment feature to its relevant files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of every page and utility in the React PWA.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark themes, plus base body and border styles.",
  "frontend/index.html": "HTML shell for the React PWA, including PWA meta tags, manifest link, Apple touch icon, and the root div with the Vite module script entry point.",
  "frontend/public/manifest.json": "PWA web app manifest for Bhangar Wala, specifying app name, theme color, display mode, icons (192px and 512px), and start URL.",
  "frontend/public/sw.js": "Service worker implementing cache-first for static assets and cache-second (network-first) for API/canister calls, with install/activate lifecycle handlers and SPA fallback to index.html.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes, including public, authenticated layout, and standalone routes for PartnerPanel and AdminRates loaded lazily with Suspense.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky top header (logo, location, notifications bell) and a bottom navigation bar; hides the nav on certain routes like booking, payment, and tracking pages.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and status flags backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Thin wrapper around the notifications query that exposes the notifications list, unread count, loading state, and a refetch function.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, covering user profiles, addresses, scrap categories/rates, bookings, payments, ratings, notifications, and support tickets.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines the eco-green OKLCH design token theme (light and dark) along with custom utility classes and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AddAddress.tsx": "Page component for adding a new pickup address, featuring a form with label, street, city, and pincode fields that submits via the useAddAddress mutation and navigates back to the addresses list.",
  "frontend/src/pages/Addresses.tsx": "Displays a list of the user's saved addresses with options to add, edit, or delete each one, using icons for Home/Work/Other labels and a floating action button to navigate to the add-address page.",
  "frontend/src/pages/AdminRates.tsx": "Admin panel page for managing scrap rates per category, allowing inline price editing with per-row save functionality and immediate effect on new bookings.",
  "frontend/src/pages/BookingConfirmation.tsx": "Post-booking confirmation page that displays booking details, auto-assigns a partner, shows partner info, and provides a cancel option.",
  "frontend/src/pages/BookingDetails.tsx": "Detail view for a single booking identified by route param, showing address, scrap items with rates, scheduled time, partner info, payment, and status badge.",
  "frontend/src/pages/Bookings.tsx": "Displays a filterable, searchable list of the user's scrap pickup bookings with status badges and relative timestamps. Supports filter chips for All/Pending/Completed/Cancelled and navigates to individual booking details.",
  "frontend/src/pages/BookPickup.tsx": "Multi-step form (Address → Scrap → Schedule → Confirm) for booking a scrap pickup, collecting address, scrap category/weight, date/time slot, and submitting the booking with estimated price calculation.",
  "frontend/src/pages/EditAddress.tsx": "Form page for editing an existing saved address, pre-populating fields from the fetched address and saving updates via the updateAddress mutation. Includes a placeholder map picker and navigates back to the addresses list on save.",
  "frontend/src/pages/Home.tsx": "Home dashboard showing a personalized greeting, scrap category grid, a book-pickup CTA card, and a list of the user's three most recent bookings with status badges. Fetches user profile, scrap categories, and bookings via React Query hooks.",
  "frontend/src/pages/Login.tsx": "Phone number login page with a country code selector, 10-digit phone input, and terms acceptance checkbox. On submission it navigates to the OTP verification page passing the full phone number.",
  "frontend/src/pages/Notifications.tsx": "Notifications page that lists user notifications sorted by timestamp with unread highlighting, icon color coding, and actions to mark all as read or clear all. Shows a skeleton loader and an empty state when there are no notifications.",
  "frontend/src/pages/OtpVerification.tsx": "OTP verification page that renders a 6-digit code input, countdown timer, and resend logic, then triggers Internet Identity login and redirects to profile setup or home based on whether a user profile exists.",
  "frontend/src/pages/PartnerPanel.tsx": "Partner-facing panel where a partner logs in by phone number, views their assigned bookings as cards, and can accept or advance booking statuses (e.g., on the way, arrived, completed).",
  "frontend/src/pages/Payment.tsx": "Payment page that displays booking items with editable final weights, calculates the total amount using scrap rates, supports cash or UPI payment methods, and submits the payment record while updating the booking status to completed.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that shows an animated checkmark, the total amount paid, payment method, and a printable receipt listing scrap items with weights and rates.",
  "frontend/src/pages/Profile.tsx": "User profile page that displays the logged-in user's name, phone, and avatar, allows inline name editing via a dialog, toggles notifications and dark mode, and provides a logout action.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile setup page that lets users enter their name, upload a profile photo, and optionally add a home address, then saves the data and navigates to the home screen.",
  "frontend/src/pages/RateService.tsx": "Rate service page where users submit a 1–5 star rating and optional comment for a completed pickup booking, with options to submit or skip.",
  "frontend/src/pages/Splash.tsx": "Splash/loading screen that displays the app logo and branding, then redirects to home or login based on the user's authentication state after a short delay.",
  "frontend/src/pages/Support.tsx": "Support page providing contact options (call, WhatsApp, email), an FAQ accordion, and a form to submit a support ticket.",
  "frontend/src/pages/TrackPickup.tsx": "Pickup tracking page that shows a step-by-step status timeline for a booking, displays assigned partner info, and allows cancellation, status simulation, or proceeding to payment.",
  "frontend/src/utils/blobStorage.ts": "Utility class `ExternalBlob` for handling binary data or URLs, supporting creation from bytes or a URL, progress callbacks, and conversion between object URLs and byte arrays.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system including custom colors (using OKLCH variables), fonts, border radii, shadows, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot describing the Bhangar Wala PWA's architecture, tech stack (React, Vite, Supabase), existing features, and known issues across versioned feature entries."
}