{
  "kind": "build_request",
  "title": "Fix booking creation and address saving errors on Book Pickup screen",
  "projectName": "Bhangar Wala",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-64",
      "text": "Fix the 'Failed to save address. Please try again.' error on the Add Address screen (`/add-address`). Diagnose and repair the `addAddress` backend call: (1) ensure the userId passed to the backend is correctly read from localStorage (the stored phone number without country code prefix if required by backend); (2) ensure all required fields (street, city, pincode) are non-empty before submission; (3) ensure the address label defaults to a valid value ('Home', 'Work', or 'Other') if unset; (4) ensure optional lat/lng fields are serialised as `null` when not provided rather than as undefined or empty string; (5) wrap the actor call in a proper try/catch and surface a descriptive inline error message. After a successful save, navigate back to `/addresses`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "again showing error while making a booking for scrap pick-up ,please fix it"
        ]
      },
      "acceptanceCriteria": [
        "Filling in Street Address, City, and Pincode and tapping 'Save Address' successfully saves the address without showing 'Failed to save address' error",
        "The userId is correctly derived from localStorage and matches the format expected by the backend addAddress method",
        "Optional lat/lng fields are passed as null (not undefined or empty string) when not entered",
        "A descriptive error message is shown inline if the backend call genuinely fails",
        "On success, the user is navigated back to /addresses and the new address appears in the list"
      ]
    },
    {
      "id": "REQ-65",
      "text": "Fix the booking creation error on the Book Pickup screen (`/book-pickup`). Diagnose and repair the `createBooking` backend call: (1) ensure the userId passed to the backend is the plain phone number from localStorage (stripped of '+91' prefix if the backend expects a plain 10-digit string); (2) ensure the addressId references a valid address that belongs to the user — if no addresses are present, block progression and prompt the user to add an address first; (3) ensure scheduledTime is serialised as an integer timestamp (nanoseconds or milliseconds as expected by the Motoko backend) and not as a string or ISO date; (4) ensure all BookingItems have valid categoryId, estimatedWeight (a positive Float), and that the array is non-empty before submission; (5) ensure totalEstimatedAmount is computed correctly as a Float and passed in the expected Motoko type; (6) wrap the actor call in a try/catch and surface a human-readable error message on the Step 4 confirm screen if the backend returns an error variant or throws. After a successful booking creation, navigate to `/booking-confirmation` with the new booking ID.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "again showing error while making a booking for scrap pick-up ,please fix it"
        ]
      },
      "acceptanceCriteria": [
        "Completing all 4 steps of the Book Pickup flow and tapping 'Confirm Booking' successfully creates a booking in the backend without an error",
        "The userId is stripped of '+91' prefix to match the backend's expected phone number format",
        "scheduledTime is passed as a valid integer timestamp in the format expected by the Motoko createBooking method",
        "BookingItems array contains at least one item with a valid categoryId and a positive estimatedWeight",
        "totalEstimatedAmount is a valid positive Float",
        "On success, the user is navigated to /booking-confirmation and the booking ID is displayed",
        "If the backend returns an error, a descriptive inline error message is shown on the confirmation step"
      ]
    },
    {
      "id": "REQ-66",
      "text": "In `backend/main.mo`, audit the `addAddress` and `createBooking` method signatures to verify they accept the argument types that the frontend is sending (Text userId, Float weights, Int timestamps, optional lat/lng as `?Float`). If any parameter types are mismatched or the methods trap on edge-case inputs (empty optional fields, zero weights, addresses without lat/lng), fix the method implementations to handle these gracefully and return a descriptive error variant rather than trapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "again showing error while making a booking for scrap pick-up ,please fix it"
        ]
      },
      "acceptanceCriteria": [
        "addAddress accepts an optional lat/lng (?Float) and does not trap when they are null",
        "createBooking accepts an Int scheduledTime and does not trap on valid inputs",
        "createBooking returns an #err variant with a descriptive message rather than trapping when invalid data is provided",
        "addAddress returns an #err variant with a descriptive message rather than trapping when invalid data is provided",
        "All method signatures are consistent with what the frontend hooks in useQueries.ts are calling"
      ]
    }
  ],
  "constraints": [
    "Do not change immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Maintain single-actor Motoko architecture — all backend logic stays in backend/main.mo",
    "Do not alter the existing auth flow (phone OTP with localStorage session)"
  ],
  "nonGoals": [
    "Redesigning the Book Pickup UI or adding new steps",
    "Adding real map/GPS functionality",
    "Changing the payment or tracking flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}