{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Switch authentication to Internet Identity (Google, Apple, Microsoft, passkey)",
  "requirements": [
    {
      "id": "REQ-47",
      "summary": "Replace phone OTP login with Internet Identity authentication on Login screen",
      "acceptanceCriteria": [
        "The Login screen shows a single 'Sign In with Internet Identity' button and no phone/OTP fields",
        "Tapping the button opens the Internet Identity popup which offers Google, Apple, Microsoft, and passkey sign-in options",
        "After successful Internet Identity login, users without a profile are redirected to `/profile-setup`",
        "After successful Internet Identity login, returning users with an existing profile are redirected to `/home`",
        "The `/otp-verification` route no longer exists and navigating to it redirects to `/login`",
        "The Splash screen redirect logic uses the Internet Identity session (via `useInternetIdentity`) instead of localStorage to determine authentication state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Replace phone number input, country code selector, OTP fields, and terms checkbox with a single 'Sign In with Internet Identity' button. Use the `useInternetIdentity` hook (already imported) to trigger login via the `login()` method. After successful login, check if a user profile exists using the `getCallerUserProfile` backend method via `useGetCallerUserProfile`. If no profile exists, navigate to `/profile-setup`; if a profile exists, navigate to `/home`. Remove all phone number and OTP form state and validation logic."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the `/otp-verification` route registration. Add a redirect or fallback so that any attempt to navigate to `/otp-verification` redirects to `/login`."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Update Splash screen to use Internet Identity for authentication state",
      "acceptanceCriteria": [
        "Splash screen reads auth state from `useInternetIdentity` hook",
        "Authenticated users are auto-redirected to `/home` after the splash delay",
        "Unauthenticated users are auto-redirected to `/login` after the splash delay"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Splash.tsx",
          "operation": "modify",
          "description": "Replace localStorage-based authentication check with the `useInternetIdentity` hook. Read `isAuthenticated` or `identity` from the hook to determine if the user is logged in. After the 2.2-second splash delay, redirect authenticated users to `/home` and unauthenticated users to `/login`. Remove any references to localStorage phone keys or OTP session keys."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Update Profile screen Logout button to use Internet Identity logout",
      "acceptanceCriteria": [
        "Tapping 'Logout' calls the Internet Identity `logout` method",
        "User is redirected to `/login` after logout",
        "Internet Identity session is fully cleared on logout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Replace the logout logic that clears localStorage with a call to the `clear()` method from the `useInternetIdentity` hook. Use the `useQueryClient` to clear all cached queries after logout. After logout completes, navigate to `/login`. Remove any references to localStorage phone keys or OTP session keys."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Update Layout component to use Internet Identity for route protection",
      "acceptanceCriteria": [
        "Layout uses `useInternetIdentity` isAuthenticated/identity to guard protected routes",
        "Unauthenticated access to any layout-wrapped route redirects to `/login`",
        "No longer reads a phone OTP session key from localStorage for auth checks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Replace localStorage-based authentication check with the `useInternetIdentity` hook. Read `isAuthenticated` or `identity` from the hook to determine if the user is logged in. If the user is not authenticated, redirect to `/login`. Remove any references to localStorage phone keys or OTP session keys for authentication checks."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Update Profile Setup screen to use Internet Identity principal as user identifier",
      "acceptanceCriteria": [
        "Profile Setup uses the Internet Identity principal as the user identifier",
        "Phone number field is optional on the profile setup form",
        "Saving the profile calls the backend with the principal-derived user ID",
        "On save, user is navigated to `/home`"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileSetup.tsx",
          "operation": "modify",
          "description": "Replace phone number lookup from localStorage with the Internet Identity principal obtained via `useInternetIdentity`. Use `identity.getPrincipal()` to derive the user identifier. Make the phone number field optional on the form (update validation and UI to reflect this). When calling `saveCallerUserProfile`, pass the principal-derived user ID. After successfully saving the profile, navigate to `/home`. Remove any references to localStorage phone keys."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Update frontend query hooks to use Internet Identity principal instead of phone number",
      "acceptanceCriteria": [
        "All backend calls that previously used a localStorage phone key now use the Internet Identity principal",
        "User-scoped queries (bookings, addresses, notifications, profile) return data for the authenticated principal",
        "No query hook reads `phone` from localStorage as the primary user identifier"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Replace all localStorage phone lookups with the Internet Identity principal obtained from the actor context. For user-scoped queries (bookings, addresses, notifications, profile), ensure they use the authenticated principal as the user identifier when calling backend methods. Remove any code that reads a phone number from localStorage as the primary user identifier. Verify that all query hooks that interact with user-specific data now rely on the principal from the `useActor` or `useInternetIdentity` hooks."
        }
      ]
    }
  ]
}