{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert to phone OTP login flow",
  "requirements": [
    {
      "id": "REQ-57",
      "summary": "Restore Login screen to original phone OTP flow with country code selector and terms checkbox, removing Internet Identity UI",
      "acceptanceCriteria": [
        "The /login route renders a phone number input with country code selector defaulting to +91",
        "A 'Send OTP' button is present and navigates to /otp-verification on valid phone number submission",
        "A terms & conditions checkbox is present",
        "The Internet Identity 'Sign In' button is not present on the login screen",
        "No II-related error state or retry button is shown on the login screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Replace the Internet Identity sign-in UI with the original phone OTP flow. Add a phone number input field, country code selector defaulting to +91, a 'Send OTP' button, and a required terms & conditions checkbox. On valid phone submission, store the phone number in sessionStorage and navigate to /otp-verification. Remove all Internet Identity button, error handling, and retry UI from this page."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Restore OTP Verification page with 6-digit input, countdown timer, and navigation based on user profile existence",
      "acceptanceCriteria": [
        "The /otp-verification route is registered and accessible",
        "6 individual digit input boxes are rendered",
        "A 60-second countdown timer is shown",
        "The 'Resend OTP' button is disabled until the timer expires",
        "Submitting any valid 6-digit code navigates to /profile-setup for new users or /home for returning users",
        "Auth session is saved to localStorage on success",
        "The helper hint 'Enter any 6-digit code to verify' is visible below the input boxes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OtpVerification.tsx",
          "operation": "modify",
          "description": "Replace the Internet Identity login trigger with the original OTP verification logic. Render 6 individual digit input boxes with the helper hint 'Enter any 6-digit code to verify' below them. Add a 60-second countdown timer and a 'Resend OTP' button that is only enabled after the timer expires. On submitting any valid 6-digit code, store an auth session object in localStorage (with phone number and timestamp), then check if the user has a profile via getCallerUserProfile. Navigate first-time users (no profile) to /profile-setup and returning users (existing profile) to /home."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove or update the redirect from /otp-verification to /login. Ensure the /otp-verification route is registered and accessible, not redirected away."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Restore Profile Setup to use phone number from localStorage as user identifier",
      "acceptanceCriteria": [
        "Profile Setup reads the phone number from localStorage set during OTP verification",
        "The phone field on the profile setup form is required",
        "createUserProfile is called with the phone-based user ID, not an Internet Identity principal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileSetup.tsx",
          "operation": "modify",
          "description": "Read the phone number from the localStorage auth session (set in OTP verification) and use it as the user identifier when calling saveCallerUserProfile. Make the phone field on the profile setup form required (not optional). Ensure the profile is associated with the phone-based session rather than an Internet Identity principal."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Restore Splash screen redirect logic to use localStorage session detection instead of Internet Identity state",
      "acceptanceCriteria": [
        "The splash screen checks localStorage for an auth session",
        "Authenticated users (session in localStorage) are redirected to /home",
        "Unauthenticated users are redirected to /login",
        "The redirect does not depend on Internet Identity initialization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Splash.tsx",
          "operation": "modify",
          "description": "Replace the Internet Identity initialization check with localStorage session detection. Check for the presence of an auth session object in localStorage. Redirect authenticated users (valid session present) to /home and unauthenticated users (no session) to /login. Remove any dependency on Internet Identity initialization state or the useInternetIdentity hook."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Restore Profile screen logout to clear localStorage auth session without calling Internet Identity logout",
      "acceptanceCriteria": [
        "Tapping 'Logout' clears localStorage and redirects to /login",
        "No Internet Identity logout call is made on the standard user logout action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Update the logout handler to clear the localStorage auth session and redirect to /login. Remove the Internet Identity clear() call from the standard user logout flow. Ensure that tapping 'Logout' only performs localStorage cleanup and navigation, without invoking any Internet Identity logout method."
        }
      ]
    }
  ]
}