{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix booking creation and address saving errors on Book Pickup screen",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Fix the 'Failed to save address. Please try again.' error on the Add Address screen by correcting userId format, field validation, address label defaults, lat/lng serialization, and error handling in the addAddress mutation",
      "acceptanceCriteria": [
        "Filling in Street Address, City, and Pincode and tapping 'Save Address' successfully saves the address without showing 'Failed to save address' error",
        "The userId is correctly derived from localStorage and matches the format expected by the backend addAddress method",
        "Optional lat/lng fields are passed as null (not undefined or empty string) when not entered",
        "A descriptive error message is shown inline if the backend call genuinely fails",
        "On success, the user is navigated back to /addresses and the new address appears in the list"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddAddress.tsx",
          "operation": "modify",
          "description": "Repair the address submission flow: (1) ensure all required fields (street, city, pincode) are validated as non-empty before calling the mutation; (2) ensure the address label defaults to 'Home' if not set by the user; (3) ensure optional lat/lng fields are explicitly set to null (not undefined or empty string) when not provided; (4) add inline error message display for backend failures; (5) ensure successful save navigates to /addresses. Verify the backend's expected Address type in backend.d.ts before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useAddAddress mutation hook: (1) ensure the userId is read from localStorage (phone number) and stripped of any '+91' prefix to match backend expectations; (2) wrap the actor.saveCallerUserProfile call in a try/catch block to surface descriptive error messages; (3) ensure the Address object passed to the backend includes street, city, pincode, and optional lat/lng as null when not provided; (4) ensure addressLabel is set to a valid default ('Home', 'Work', or 'Other') if missing; (5) invalidate the 'userProfile' query on success to refresh the address list. Verify the backend's expected UserProfile and Address types in backend.d.ts before implementing."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Fix the booking creation error on the Book Pickup screen by correcting userId format, addressId validation, scheduledTime serialization, BookingItems validation, totalEstimatedAmount computation, and error handling in the createBooking mutation",
      "acceptanceCriteria": [
        "Completing all 4 steps of the Book Pickup flow and tapping 'Confirm Booking' successfully creates a booking in the backend without an error",
        "The userId is stripped of '+91' prefix to match the backend's expected phone number format",
        "scheduledTime is passed as a valid integer timestamp in the format expected by the Motoko createBooking method",
        "BookingItems array contains at least one item with a valid categoryId and a positive estimatedWeight",
        "totalEstimatedAmount is a valid positive Float",
        "On success, the user is navigated to /booking-confirmation and the booking ID is displayed",
        "If the backend returns an error, a descriptive inline error message is shown on the confirmation step"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BookPickup.tsx",
          "operation": "modify",
          "description": "Repair the booking creation flow in Step 4 (confirm screen): (1) ensure the addressId is validated to reference a valid user address before allowing booking submission — if no addresses exist, block progression and prompt the user to add an address first; (2) ensure all BookingItems have a valid categoryId and a positive estimatedWeight before submission; (3) ensure totalEstimatedAmount is computed as a positive Float and passed correctly; (4) ensure scheduledTime is serialized as an integer timestamp (nanoseconds or milliseconds as expected by the backend); (5) add inline error message display on the confirm screen if the backend returns an error variant or throws; (6) ensure successful booking creation navigates to /booking-confirmation with the booking ID. Verify the backend's expected BookingRequest and BookingItemRequest types in backend.d.ts before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useCreateBooking mutation hook: (1) ensure the userId is read from localStorage (phone number) and stripped of any '+91' prefix to match backend expectations; (2) ensure scheduledTime is passed as a bigint timestamp (convert from Date to nanoseconds or milliseconds as required by the backend); (3) ensure the BookingItems array is non-empty and each item has a valid categoryId and a positive estimatedWeight before calling the actor; (4) ensure totalEstimatedAmount is passed as a Float; (5) wrap the actor.createBooking call in a try/catch block to surface descriptive error messages; (6) handle both error variants and thrown exceptions gracefully; (7) invalidate relevant queries (bookings, notifications) on success. Verify the backend's expected BookingRequest type in backend.d.ts before implementing."
        }
      ]
    }
  ]
}